app/Controllers/Alternative.php

    public function index(): string
    {

        $breadcrumbs =
        [
            [
                'name' => 'Alternative',
                'link' => '/alternative',
            ],
            [
                'name' => 'List',
                'link' => '',
            ],
        ];

        $alternative = $this->alternativeModel->findAll();
---
SELECT *
FROM `alternative`