app/Controllers/Bobot.php

SELECT *
FROM `bobot`
---
    public function index(): string
    {

        $breadcrumbs =
        [
            [
                'name' => 'Bobot',
                'link' => '/bobot',
            ],
            [
                'name' => 'List',
                'link' => '',
            ],
        ];

        $bobot = $this->bobotModel->findAll();