app/Controllers/Kriteria.php

SELECT *
FROM `kriteria`
---
    public function index(): string
    {

        $breadcrumbs =
        [
            [
                'name' => 'Kriteria',
                'link' => '/kriteria',
            ],
            [
                'name' => 'List',
                'link' => '',
            ],
        ];

        $kriteria = $this->kriteriaModel->findAll();