app/Controllers/Penilaian.php

    public function index(){
        $breadcrumbs =
        [
            [
                'name' => 'Penilaian',
                'link' => '/penilaian',
            ],
            [
                'name' => 'List',
                'link' => '',
            ],
        ];

        $alternative = $this->alternativeModel->findAll();
        $subKriteria = $this->subkriteriaModel->getWithKriteria();
        $penilaian = $this->penilaianModel->getWithAlternatifAndSubKriteria();
        $kriteria = $this->kriteriaModel->findAll();
---
SELECT *
FROM `alternative`
SELECT *
FROM `kriteria`

    public function add(){
        $breadcrumbs =
        [
            [
                'name' => 'Penilaian',
                'link' => '/penilian',
            ],
            [
                'name' => 'List',
                'link' => '/penilaian',
            ],
            [
                'name' => 'Add',
                'link' => '',
            ],
        ];

        $kriteria = $this->kriteriaModel->findAll();
        $subkriteria = $this->subkriteriaModel->getWithKriteria();
        $alternative = $this->alternativeModel->findAll();
---
SELECT *
FROM `kriteria`
SELECT *
FROM `alternative`