app/Controllers/Perhitungan.php

    public function index()
    {
        $breadcrumbs = [
            ['name' => 'Perhitungan', 'link' => '/perhitungan'],
            ['name' => 'List', 'link' => ''],
        ];

        $kriterias = $this->kriteriaModel->findAll();

        if ($this->request->getVar()) {
            // Validasi input kriteria
            $this->validateKriteria($kriterias);

            // Ambil data alternatif
            $alternatives = $this->alternativeModel->findAll();
---
SELECT *
FROM `kriteria`
SELECT *
FROM `alternative`

    private function getNilaiStandar($subkriteria_id)
    {
        $nilai_standar = [];
        foreach ($subkriteria_id as $sub) {
            $nilai_sub_kriteria = $this->subkriteriaModel->find($sub['id']);
---
SELECT *
FROM `sub_kriteria`
WHERE `sub_kriteria`.`id` = '42'