app/Models/BobotModel.php

    public function bobotNilaiWithSelisih($selisih){
        return $this->select('bobot.*')
                        ->where('bobot.selisih', $selisih)
                        ->first();;
---
SELECT `bobot`.*
FROM `bobot`
WHERE `bobot`.`selisih` = -2
 LIMIT 1