app/Models/PenilaianModel.php

SELECT `penilaian`.*, `alternative`.`nama_alternative`, `sub_kriteria`.`nama_subkriteria`, `sub_kriteria`.`nilai`, `kriteria`.`id`, `kriteria`.`nama_kriteria`
FROM `penilaian`
LEFT JOIN `alternative` ON `alternative`.`id` = `penilaian`.`alternative_id`
LEFT JOIN `sub_kriteria` ON `sub_kriteria`.`id` = `penilaian`.`sub_kriteria_id`
LEFT JOIN `kriteria` ON `kriteria`.`id` = `sub_kriteria`.`kriteria_id`
---
    public function getWithAlternatifAndSubKriteria()
    {
        return $this->select('penilaian.*,
                          alternative.nama_alternative,
                          sub_kriteria.nama_subkriteria,
                          sub_kriteria.nilai,
                          kriteria.id,
                          kriteria.nama_kriteria') // Tambahkan nama_kriteria
                ->join('alternative', 'alternative.id = penilaian.alternative_id', 'left')
                ->join('sub_kriteria', 'sub_kriteria.id = penilaian.sub_kriteria_id', 'left')
                ->join('kriteria', 'kriteria.id = sub_kriteria.kriteria_id', 'left') // Join ke tabel kriteria
                ->findAll();