app/Models/SubKriteriaModel.php

SELECT `sub_kriteria`.*, `kriteria`.`nama_kriteria`, `kriteria`.`jenis_kriteria`
FROM `sub_kriteria`
LEFT JOIN `kriteria` ON `kriteria`.`id` = `sub_kriteria`.`kriteria_id`
---
    public function getWithKriteria()
    {
        return $this->select('sub_kriteria.*, kriteria.nama_kriteria, kriteria.jenis_kriteria')
            ->join('kriteria', 'kriteria.id = sub_kriteria.kriteria_id', 'left')
            ->findAll();

SELECT `sub_kriteria`.*, `kriteria`.`nama_kriteria`
FROM `sub_kriteria`
LEFT JOIN `kriteria` ON `kriteria`.`id` = `sub_kriteria`.`kriteria_id`
WHERE `kriteria`.`id` = '11'
---
    public function getAllWithKriteriaById($id)
    {
        return $this->select('sub_kriteria.*, kriteria.nama_kriteria')
            ->join('kriteria', 'kriteria.id = sub_kriteria.kriteria_id', 'left')
            ->where('kriteria.id', $id)
            ->findAll();